models/CharactersFrom.php

INSERT INTO `characters` (`character`) VALUES ('Вареный')
---
    public function addCharacters(){
        $character = new Characters();
        $character->character = $this->character;
        $character->save();

SELECT * FROM `characters`
---
    public function searchCharacters(){
        return Characters::find()->all();

DELETE FROM `statistic` WHERE `id_char`='3'
DELETE FROM `characters` WHERE `id_char`='3'
---
    public function deleteChar($id){
        Statistic::deleteAll(['id_char' => $id]);
        Characters::deleteAll(['id_char' => $id]);