models/PlayersForm.php

    public function addPlayers(){
        $players = new Players();
        $players->name = $this->name;
        $players->save();
---
INSERT INTO `players` (`name`) VALUES ('Сурок')

    public function searchPlayers(){
        return Players::find()->all();
---
SELECT * FROM `players`

    public function deletePlayers($id){
        Statistic::deleteAll(['id_name' => $id]);
        Players::deleteAll(['id_name' => $id]);
---
DELETE FROM `statistic` WHERE `id_name`='1'
DELETE FROM `players` WHERE `id_name`='1'