models/StatisticFrom.php

    public function addStatistics($id_char,$id_player,$point){

        $statistic = Statistic::find()
            ->select('id')
            ->where(['id_name' => $id_player, 'id_char'=>$id_char])
            ->one();
        //Если в таблице уже есть, значит обновляем
        if ($statistic != null) {
            $statistic = Statistic::findOne($statistic);
            $statistic->point = $point;
            $statistic->update();
        }
        //Если нет - добавляем новую
        else{
            $statistic = new Statistic();
            $statistic->id_name = $id_player;
            $statistic->id_char = $id_char;
            $statistic->point = $point;
            $statistic->save();
---
SELECT `id` FROM `statistic` WHERE (`id_name` IS NULL) AND (`id_char`='4')
INSERT INTO `statistic` (`id_name`, `id_char`, `point`) VALUES (1, 1, 3)

    public function searchStatistics(){

        $statistic = (new \yii\db\Query())
            ->select(['players.name', 'characters.character', 'point'])
            ->from('statistic')
            ->join('INNER JOIN', 'players','players.id_name = statistic.id_name')
            ->join('INNER JOIN', 'characters','characters.id_char = statistic.id_char')->orderBy([
                'players.name' => SORT_DESC,
                'characters.character' => SORT_ASC,
            ])->all();
---
SELECT `players`.`name`, `characters`.`character`, `point` FROM `statistic` INNER JOIN `players` ON players.id_name = statistic.id_name INNER JOIN `characters` ON characters.id_char = statistic.id_char ORDER BY `players`.`name` DESC, `characters`.`character`